tutorials/solvers/interPlicFoam/oilDeaeration/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

atmosphere.stl
{
    extractionMethod    extractFromSurface;
    includedAngle       150;
    writeObj            no;

    subsetFeatures
    {
        nonManifoldEdges    no;
        openEdges           yes;
    }
}

inlet.stl
{
    extractionMethod    extractFromSurface;
    includedAngle       150;
    writeObj            no;

    subsetFeatures
    {
        nonManifoldEdges    no;
        openEdges           yes;
    }
}

pipeWalls.stl
{
    extractionMethod    extractFromSurface;
    includedAngle       150;
    writeObj            no;

    subsetFeatures
    {
        nonManifoldEdges    no;
        openEdges           yes;
    }
}

tankWalls.stl
{
    extractionMethod    extractFromSurface;
    includedAngle       150;
    writeObj            no;

    subsetFeatures
    {
        nonManifoldEdges    no;
        openEdges           yes;
    }
}

// ************************************************************************* //
